tests/com/l7tech/server/policy/assertion/xml/requestWith2BodyChildren.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <def:in0 xmlns:def="http://DefaultNamespace">
            <aData>25</aData>
        </def:in0>
        <def:in1 xmlns:def="http://DefaultNamespace">
            <bData>blah</bData>
        </def:in1>
    </soap:Body>
</soap:Envelope>